---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateNewDesignOption
source: html/504ee276-a3bc-6111-131e-3d64fda32ba8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateNewDesignOption Property

Cannot create a new empty design option

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateNewDesignOption { get; }
```